# IsValidPlaneReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointOnPlane..::..IsValidPlaneReference Method
PointOnPlane Class See Also
---
Check whether a geometry reference corresponds to a referenceable plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool IsValidPlaneReference(
	Document doc,
	Reference planeReference
)
```

Visual Basic
---
```text
Public Shared Function IsValidPlaneReference ( _
	doc As Document, _
	planeReference As Reference _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidPlaneReference(
	Document^ doc,
	Reference^ planeReference
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document
planeReference
    Type: Autodesk.Revit.DB..::..Reference
# Remarks
Valid plane references include: planar faces of solids; the PlaneReference properties of Level and SketchPlane; the Reference property of ReferencePlane.
# See Also
PointOnPlane Class
Autodesk.Revit.DB Namespace